<?php

namespace Database\Seeders;

use App\Models\Constant;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class JobTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $parent=Constant::where('name','jobType')->first();
        $jobs=[
            "سكريتارية",
            "سكريتارية تنفيذية",
            "ريسبشن",
            "خدمة عملاء",
            "مدير",
            "امانة سر",
            "مسوق",
            "محاسب",
            "كاشير",
            "مدير صالة",
            "شيف",
            "كوميك",
            "مدرس",
            "دكتور",
            "معلم صف",
            "مدخل بيانات",
            "دعم فني",
            "صيانة",
            "كتابة محتوى",
            "سوشيال ميديا",
            "مبرمج",
            "مترجم",
            "مرشد",
            "ادارة تنفيذية",
            "وكيل",
            "مبيعات",
            "علاقات عامة",
            "ورشة ويب",
            "ورشة موبايل",
            "ورشة ادارة",
            "ورشة محاسبة",
            "شؤون قانونية",
            "سائق",
            "ناطور",
            "حراسة",
            "مرافقة شخصية",
            "عامل نظافة",
            "عامل بار",
            "مدرب (كوتش)",
            "مساعد مدرب",
            "ادارة مكتب",
            "مندوب",
            "موجه",
            "ديزاينر",
            "مختبر جودة",
            "مبرمج ويب فرونت",
            "مبرمج ويب باك",
            "مبرمج موبايل باك",
            "مبرمج موبايل فرونت",
            "مبرمج ويب",
            "مبرمج موبايل",
            "مبرمج ديسكتوب",
            "سايبر سيكيوريتي",
            "مدير مشروع",
            "محلل بيانات",
            "مسؤول أنظمة",
            "موسيقي",
            "فنون"
        ];
        foreach ($jobs as $job){
            $j['parentId']=$parent->_id;
            $j['name']=$job;
            Constant::create($j);
        }
    }
}
